Tekla Open API Reference for Tekla Structures 2025
ISolid.GetFaceEnumerator Method
 Returns a new face enumerator in the current plane.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
FaceEnumerator GetFaceEnumerator()
Function GetFaceEnumerator As FaceEnumerator
Return Value
Type: FaceEnumerator
A face enumerator to enumerate through the solid's faces.
See Also
Reference
ISolid Interface
Tekla.Structures.Solid Namespace